<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */
    'ar'            => 'عربي',
    'en'            => 'english',
    'es'            => 'español',
    'it'            => 'Italian',
    'fr'            => 'français',
    'de'            => 'Deutsche',
    'ru'            => 'русский',

    'air_flights'   => 'رحلات جوية',
    'sea_trips'     => 'رحلات بحرية',
    'land_trips'    => 'رحلات برية',
    'my_​​trips'      => 'رحلاتي',
    'search'        => 'بحث',
    'search_for'    => 'بحث عن ...',
    'city'          => 'المدينة',
    'filter_by'     => 'فرز بواسطة :',
    'category'      => 'النوع',
    'departure_date'=> 'تاريخ المغادرة :',
    'date'          => 'تاريخ',
    'rate'          => 'تقييم',
    'special_trips' => 'المميزة',

    'from'          => 'من :',
    'to'            => 'إلي :',
    'age_from'      => 'العمر من :',
    'years'         => 'سنوات',
    'available_places'=> 'الاماكن المتاحة',
    'persons'       => 'اشخاص',
    'price'         => 'السعر :',
    'duration_from' => 'الرحلة من :',
    'you_are_joined' => 'انت مشترك في هذه الرحلة ',
    'cancel_trip'   => 'الغاء الرحلة',
    'join_trip'     => 'اشترك في الرحلة',

    'my_joined_trips'=> 'رحلاتي',
    'search_for_trip'=> 'بحث عن رحلة !',
    'trip_founded'   => 'الرحلات المتاحة',

    //company text
    'dashboard'      => 'لوحة التحكم',
    'my_trips'       => 'الرحلات المنشأة',
    'active_trips'   => 'الرحلات المفعلة',
    'disabled_trips' => 'الرحلات المتوقفة',
    'completed_trips'=> 'الرحلات المكتملة',
    'new_join_req'   => 'طلبات الالتحاق',
    'resolved_join_req'=> 'الطلبات المقبوله',
    'rejected_join_req'=> 'الطلبات المرفوضة',
    'confirmed_join_req'=> 'الطلبات المؤكدة',

    'mark_disabled'     => 'تعطيل',
    'mark_active'       => 'تفعيل',
    'mark_completed'    => 'اكتمل العدد',
    'mark_available'    => 'اماكن متاحه',
    'req_date'          => 'تاريخ الطلب',
    'resolve_request'   => 'قبول الطلب',
    'reject_request'    => 'رفض الطلب',
    'status'            => 'الحالة',
    'name'              => 'الاسم',
    'email'             => 'بريد الكتروني',

    'title'             => 'عنوان الرحلة:',
    'description'       => 'الوصف:',
    'start'             => 'محطة السفر:',
    'destination'       => 'وجهه السفر:',
    'phone'             => 'رقم الهاتف:',
    'trip_start'        => 'تاريخ السفر:',
    'trip_end'          => 'تاريخ العودة:',
    'images'            => 'الصور:',
    'add'               => 'اضافة ',
    'new_trip'          => 'رحلة جديدة ',

    'blocked_partners'  => 'الشركات المحظورة',
    'active_partners'   => 'الشركات النشطة',
    'all_partners'      => 'جميع الشركات',
    'partners'          => 'الشركات',
    'users'             => 'المستخدمين',
    'blocked_users'     => 'المستخدمين المحظورين',
    'active_users'      => 'المستخدمين النشطين',
    'all_users'         => 'كل المستخدمين',

    'block_user'        => 'حظر المستخدم',
    'active_user'       => 'تفعيل المستخدم',
    'pending_partners'  => 'طلبات الانضمام',
    'block_partner'     => 'حظر',
    'active_partner'     => 'تفعيل',
    'accept_partner'     => 'قبول الطلب',
    'reject_partner'     => 'رفض الطلب',
    'travel_partner'     => 'شركة سفر',

    'partner_login' => 'تسجيل الدخول لحساب الشركة',
    'login'         => 'تسجيل الدخول',
    'admin_login'   => 'تسجيل الدخول لإدارة الموقع',
    'register'      => 'حساب جديد',
    'your_name'          => 'الاسم',
    'your_email'         => 'البريد الالكتروني',
    'password'           => 'كلمة المرور',
    'confirm_pass'       => 'تأكيد كلمة المرور',
    'have_account'       => 'لديك حساب ؟',
    'sign_up'            => 'تسجيل',
    'forgot_password'    => 'نسيت كلمة المرور؟',
    'rejected_partners'  => 'الطلبات المرفوضة',
    'travel_day'         => 'موعد السفر',

    'Edit_profile'       => 'تعديل الحساب',
    'current_password'   => 'كلمة المرور الحالية',
    'new_password'       => 'كلمة المرور الجديدة',
    'new_password_confirmation'=> 'تأكيد كلمة المرور الجديدة',
    'save'               => 'حفظ',
    'joiners'            => 'عدد المشتركين',

    'enter_voucher'      => 'ادخل كود الخصم',
    'code_invalid'       => 'كود غير صالح',
    'code_valid'         => 'كود صالح',
    'add_voucher'        => 'اضافة كود خصم',
    'discount_percent'   => 'نسبة الخصم',
    'expire_at'          => 'موعد الانتهاء',
    'voucher_created'    => 'تم اضافة كود الخصم',
    'error_happened'     => 'حدث خطأ',
    'code'               => 'كود الخصم',
    'discount'           => 'تسبة الخصم',
    'created_at'         => 'تاريخ الخصم',
    'expire_at'          => 'تاريخ الانتهاء',
    'times_use'          => 'عدد مرات الاستخدام',
    'active_voucher'     => 'اكواد مفعلة',
    'expired_voucher'    => 'اكواد منتهيه',
    'disabled_voucher'   => 'اكواد معطلة',
    'joined_with_code'   => 'تم الاشتراك بكود الخصم ',

    'check'           => 'فحص الكود',
    'check_QR_user'   => 'التأكد من كود الاشتراك',
    'join_code'       => 'كود الاشتراك',
    'partner_register'  => 'حساب شركة جديد',

    'resetPassword'     => 'اعادة تعيين كلمة المرور',
    'sendEmail'         => 'ارسل الرابط',

    'your_phone'      => 'رقم الهاتف',
    'advertisement'   => 'اعلانات',
    'active_ads'      => 'اعلانات نشطة',
    'disactive_ads'   => 'اعلانات مخفية',
    'hide_ads'        => 'اخفاء',
    'show_ads'        => 'تنشيط',
    'new_ads'         => 'اعلان جديد',
    'ads_title'       => 'عنوان الاعلان',
    'ads_company'     => 'جهة الاعلان',
    'ads_link'        => 'رابط الاعلان',
    'ads'             => 'اعلانات',
    'all_ads'         => 'جميع الاعلانات',
    'hided_ads'       => 'الاعلانات متوقفة',
    'show_ads'        => 'اعلانات نشطة',
    'acceptTerms'     => 'انا اوافق علي الشروط والاحكام',

    'support'           => 'الدعم الفني',
    'about_us'          => 'من نحن',
    'message_admin'     => 'مراسلة الادارة',
    'customers_and_partners' => 'العملاء والشركات',
    'terms'             => 'شروط الخدمة',
    'customer_terms'    => 'شروط العملاء',
    'partner_terms'     => 'شروط الشركات',
    'sign_as_customer'  => 'التسجيل بحساب عميل',
    'sign_as_partner'   => 'التسجيل بحساب شركة',
    'message_whats'     => 'مراسلة عبر واتساب',

    'message'       =>'رسالة',
    'send'          =>'ارسال',
    'new_message'   =>'مراسلة الادارة',
    'new_voucher'   =>'اضافة كود خصم',
    'profileUpdated'   =>'تم تحديث بيانات حسابك',

    'sorry'             =>'عفوا',
    'needToActive'      =>'حسابك بحاجة للتفعيل',
    'sendActivation'    =>'ارسل ايميل التفعيل',
    'wellcome_back'     =>'مرحبا بعودتك',
    'account_pending'   =>'حسابك الان في مرحلة المراجعة',
    'wellcome'          =>'مرحبا',
    'profile_updated'   =>'تم تحديث بيانات حسابك',
    'password_failed'   =>'خطأ في كلمة المرور',
    'account_blocked'   =>'تم حظر حسابك',
    'account_rejected'  =>'تم رفض حسابك',
    'account_activated' =>'تم تفعيل الحساب يمكنك استخدام جميع الخدمات',
    'logout'            =>'تسجيل الخروج',

    //start of terms page
    'about_text_head'   => 'نبذة عنا ',
    'terms_intro'       => 'مقدمة',
    'terms_intro_text'       => 'إننا نهتم بشكل كبير بخصوصية زوار موقعنا، ونتعهد بحمايتها. تشرح هذه السياسة كيفية التصرف في معلوماتك الشخصية.
بموافقتك على استخدامنا لملفات تعريف الارتباط وفقًا لبنود هذه السياسة عند زيارتك لموقعنا الإلكتروني لأول مرة فإنك تسمح لنا باستخدام ملفات تعريف الارتباط في كل مرة تزور فيها موقعنا.
',
    'info_colection'       => 'جمع المعلومات الشخصية',
    'info_colection_text'  => 'قد يتم جمع وتخزين واستخدام المعلومات الشخصية التالية: معلومات حول جهاز الكمبيوتر الخاص بك بما في ذلك عنوان بروتوكول الإنترنت الخاص بك، والموقع الجغرافي، ونوع المتصفح والإصدار، ونظام التشغيل.
 معلومات حول زياراتك لهذا الموقع واستخدامه بما في ذلك مصدر الإحالة، ومدة الزيارة، وما تشاهده على الصفحة، ومسارات التصفح في الموقع.
 المعلومات التي تدخلها عند التسجيل في موقعنا الإلكتروني، مثل عنوان بريدك الإلكتروني.
المعلومات التي تدخلها عند إنشاء ملف تعريف على موقعنا – على سبيل المثال، اسمك، صور ملفك الشخصي، الجنس، تاريخ الميلاد
 المعلومات، مثل اسمك وعنوان بريدك الإلكتروني، التي تدخلها من أجل إعداد اشتراكات في رسائل البريد الإلكتروني و / أو الرسائل الإخبارية لدينا ؛
 المعلومات التي تدخلها أثناء استخدام الخدمات على موقعنا.
 المعلومات التي يتم إنشاؤها أثناء استخدام موقعنا الإلكتروني، بما في ذلك مواعيد وتكرار استخدامك للموقع والظروف التي تستخدم فيها الموقع.
المعلومات المتعلقة بأي شيء تشتريه، أو الخدمات التي تستخدمها، أو المعاملات التي تجريها من خلال موقعنا الإلكتروني، والتي تشمل اسمك وعنوانك ورقم هاتفك وعنوان بريدك الإلكتروني وتفاصيل بطاقة الائتمان.
 المعلومات التي تنشرها على موقعنا الإلكتروني بغرض مشاركتها على الإنترنت، والتي تشمل اسم المستخدم الخاص بك وصور ملفك الشخصي ومحتوى مشاركاتك.
 المعلومات الواردة في أي مراسلات ترسلها إلينا عبر البريد الإلكتروني أو عبر موقعنا الإلكتروني، بما في ذلك المحتوى المشترك والبيانات الوصفية.
 أي معلومات شخصية أخرى ترسلها إلينا.
',


    'about_text'        => ' SAFAREGY
‏ هى بوابة مشهورة تهتم بالخدمات السياحيه يمكنك عن طريقها اختيار وحجز و شراء الرحلات البحريه والصحراوى وخدمات اخرى كثيره فى مجال السياحه عبر الإنترنت بكل سهولة و امان مقرها الرئيسي في القاهرة، تأسس الموقع في عام ٢٠٢٠ .
مهمتها الاساسية هي جعل السفر والسياحه عبر العالم أسهل للجميع، يحتوي الموقع على الكثير من الشركات التى تعمل فى مجال السياحه في 228 دولة ومنطقة حول العالم
',

    'using_info'=>'استخدام معلوماتك الشخصية',
    'using_info_text'=>'تستخدم المعلومات الشخصية المقدمة إلينا عبر موقعنا الإلكتروني في الأغراض الموضحة في هذه السياسة أو على الصفحات ذات الصلة من الموقع. قد نستخدم معلوماتك الشخصية في الأغراض التالية:
 إدارة موقعنا وأعمالنا على شبكة الإنترنت.
تخصيص موقعنا على شبكة الإنترنت ليكون أكثر ملاءمة بالنسبة لك.
تمكينك من استخدام الخدمات المتاحة على موقعنا.
توفير الخدمات المشتراة من خلال موقعنا على شبكة الإنترنت.
إرسال البيانات والفواتير وإشعارات الدفع لك، وتحصيل المدفوعات منك.
إرسال رسائل تجارية غير تسويقية إليك.
 إرسال إشعارات عبر البريد الإلكتروني التي قمت بطلب إرسالها على وجه التحديد إليك.
 إرسال نشرة البريد الإلكتروني إليك، إذا كنت قد طلبت ذلك (يمكنك إبلاغنا في أي وقت إذا لم تعد تحتاج إلى النشرة الإخبارية).
 إرسال المراسلات التسويقية المتعلقة بأعمالنا أو أعمال الجهات الخارجية التي تم اختيارها بعناية والتي نعتقد أنها قد تهمك، عن طريق البريد أو، إذا كنت قد وافقت على ذلك بالتحديد، عن طريق البريد الإلكتروني أو أي تقنية مشابهة (يمكنك إبلاغنا في أي وقت إذا لم تعد تحتاج إلى هذه المراسلات التسويقية).
تزويد الأطراف الثالثة بمعلومات إحصائية عن مستخدمينا (غير أن هذه الأطراف الثالثة لن تتمكن من تحديد المستخدمين لتلك المعلومات بحد ذاتهم).
التعامل مع الاستفسارات والشكاوى التي تقدمها أنت أو تقدم لنا بشأنك على موقعنا.
 حماية موقعنا من الاحتيال والحفاظ على أمنه.
التحقق من الامتثال للشروط والأحكام التي تحكم استخدام موقعنا الإلكتروني (بما في ذلك مراقبة الرسائل الخاصة المرسلة عبر خدمة الرسائل الخاصة بموقعنا).
استخدامات أخرى.
إذا قمت بتقديم معلومات شخصية للنشر على موقعنا، فسنقوم بنشر هذه المعلومات واستخدامها وفقًا للترخيص الذي تمنحه لنا.
يمكن استخدام إعدادات الخصوصية الخاصة بك للحد من نشر معلوماتك على موقعنا الإلكتروني ويمكن تعديلها باستخدام عناصر التحكم في الخصوصية على الموقع.
لن نزود أي طرف ثالث، دون موافقتك الصريحة، بمعلوماتك الشخصية لأغراض التسويق المباشر لأي طرف آخر.
',
'detect_your_info'=>'الكشف عن المعلومات الشخصية',
'detect_your_info_text'=>'يمكن أن نقوم بالكشف عن معلوماتك الشخصية لأي من موظفينا أو مسؤولينا أو شركات التأمين أو المستشارين المحترفين أو الوكلاء أو الموردين أو المقاولين من الباطن التابعين لنا القدر الضروري بشكل معقول للأغراض المنصوص عليها في هذه السياسة.
قد نقوم بالإفصاح عن معلوماتك الشخصية لأي عضو في مجموعة شركاتنا (وهذا يعني الشركات التابعة لنا، والشركة القابضة الأصلية وجميع فروعها) بالقدر الضروري بشكل معقول للأغراض المنصوص عليها في هذه السياسة.
قد نكشف عن معلوماتك الشخصية:
القدر الذي يطلب منا القيام به بموجب القانون.
 فيما يتعلق بأي إجراءات قانونية جارية أو محتملة.
 من أجل إنشاء أو ممارسة أو الدفاع عن حقوقنا القانونية (بما في ذلك توفير معلومات للآخرين لأغراض منع الاحتيال والحد من مخاطر الائتمان).
إلى المشتري (أو المشتري المحتمل) لأي عمل أو أصل نبيعه (أو ننوي ذلك).
أي شخص نعتقد على نحو معقول أنه قد يتقدم بطلب إلى محكمة أو سلطة مختصة أخرى بطلب الإفصاح عن تلك المعلومات الشخصية، وفقًا لتقديرنا المعقول، ويكون من المحتمل بشكل معقول أن تأمر هذه المحكمة أو السلطة بالكشف عن تلك المعلومات الشخصية.
باستثناء ما هو منصوص عليه في هذه السياسة، فإننا لن نقدم معلوماتك الشخصية إلى أطراف ثالثة.
',
    'transfer_data'=>'النقل الدولي للبيانات',
    'transfer_data_text'=>'قد يتم تخزين المعلومات التي نجمعها أو معالجتها أو نقلها بين أي من البلدان التي نعمل فيها لتمكيننا من استخدام المعلومات وفقًا لهذه السياسة.
قد يتم نقل المعلومات التي نجمعها إلى البلدان التالية والتي لا تخضع لقوانين حماية البيانات المكافئة لتلك المعمول بها في المنطقة الاقتصادية الأوروبية: وهذه الدول هي الولايات المتحدة الأمريكية، روسيا، اليابان، الصين، والهند.
 لا نستطيع منع استخدام الآخرين أو إساءة استخدامهم للمعلومات الشخصية التي تنشرها على موقعنا الإلكتروني أو ترسلها للنشر على موقعنا الإلكتروني والمتاحة عبر الإنترنت في جميع أنحاء العالم.
أنت توافق صراحة على عمليات نقل المعلومات الشخصية الموضحة في هذا القسم
',
    'saving_your_data'=>'الاحتفاظ بالمعلومات الشخصية',
    'saving_your_data_text'=>' يحدد هذا القسم “6 ” السياسات والإجراءات التي نتبعها للاحتفاظ بالبيانات، والتي صممت للمساعدة في ضمان امتثالنا لالتزاماتنا القانونية المتعلقة بالاحتفاظ بالمعلومات الشخصية وحذفها.
لا يجوز الاحتفاظ بالمعلومات الشخصية التي نقوم بمعالجتها لأي غرض أو أغراض لفترة أطول مما هو ضروري لهذا الغرض أو لتلك الأغراض.
. دون الإخلال بالبند 6، فإننا عادة ما نقوم بحذف البيانات الشخصية التي تندرج ضمن الفئات المبينة أدناه في التاريخ / الوقت المبين أدناه:
نوع البيانات الشخصية تحذف في {أدخل الوقت/ التاريخ}؛ و
. { أدخل تواريخ وأوقات إضافية}.
بصرف النظر عن الأحكام الأخرى الواردة في هذا القسم 6، فإننا نحتفظ بالوثائق (بما في ذلك المستندات الإلكترونية) التي تحتوي على بيانات شخصية:
بالقدر المطلوب بموجب القانون.
إذا كنا نعتقد أن هذه المستندات قد تكون ذات صلة بأي إجراءات قانونية جارية أو محتملة.
من أجل بدء أو ممارسة أو الدفاع عن حقوقنا القانونية (بما في ذلك توفير المعلومات للآخرين لأغراض منع الاحتيال والحد من مخاطر الائتمان).
',
    'safe_of_data'=>'أمن معلوماتك الشخصية',
    'safe_of_data_text'=>'أمن معلوماتك الشخصية  نتعهد باتخاذ الاحتياطات التقنية والتنظيمية المعقولة لمنع فقدان معلوماتك الشخصية أو إساءة استخدامها أو تغييرها.
نتعهد بتخزين جميع المعلومات الشخصية التي تقدمها على خوادمنا الآمنة (المحمية بكلمة مرور وجدار الحماية).
 جميع المعاملات المالية الإلكترونية التي يتم القيام بها من خلال موقعنا الإلكتروني محمية بتقنية التشفير.
 تقرّ بموافقتك على هذه السياسة بمعرفتك بأن نقل المعلومات عبر الإنترنت غير آمن بطبيعته، ولا يمكننا ضمان أمن البيانات المرسلة عبر الإنترنت.
 أنت مسؤول عن الحفاظ على سرية كلمة المرور التي تستخدمها للوصول إلى موقعنا. لن نطلب منك كلمة المرور الخاصة بك (إلا عند تسجيل الدخول إلى موقعنا).
',
    'editing'=>'التعديلات',
    'editing_text'=>'قد نقوم بتحديث هذه السياسة من وقت لآخر عن طريق نشر نسخة جديدة على موقعنا. يجب عليك مراجعة هذه الصفحة من حين لآخر للتأكد من فهمك لأي تغييرات تطرأ على هذه السياسة، وقد نخطرك بالتغييرات التي تطرأ على هذه السياسة عن طريق البريد الإلكتروني أو من خلال نظام المراسلة الخاص على موقعنا.',
    'your_law'=>'حقوقك',
    'your_law_text'=>'قد تطلب منا تزويدك بأي معلومات شخصية نحتفظ بها عنك، يخضع توفير هذه المعلومات لما يلي:
دفع الرسوم {أدخل الرسوم إذا كانت منطبقة}.
وتقديم إثبات الهوية المناسب ({قم بتعديل النص ليعكس سياسة موقعك، عادةً ما نقبل نسخة من جواز سفرك مصدقًا من كاتب العدل بالإضافة إلى نسخة أصلية من فاتورة خدمات تُظهر عنوانك الحالي}) .
قد نمتنع عن تزويدك بالمعلومات الشخصية التي تطلبها بالقدر الذي يسمح به القانون.
قد تطلب منا في أي وقت عدم معالجة معلوماتك الشخصية لأغراض التسويق.
من الناحية العملية، إما أنك ستوافق بشكل صريح مسبقًا على استخدامنا لمعلوماتك الشخصية لأغراض التسويق، أو سنمنحك فرصة لإلغاء الاشتراك في استخدام معلوماتك الشخصية لأغراض التسويق.
',

    'third_part'=>'مواقع الطرف الثالث',
    'third_part_text'=>'يشتمل موقعنا على روابط تشعبية وتفاصيل عن مواقع خاصة بأطراف ثالثة، علمًا بأنه ليس لدينا أي سيطرة على سياسات الخصوصية وممارسات الأطراف الثالثة كما أننا لسنا مسؤولين عنها.',
    'updating_data'=>'تحديث المعلومات',
    'updating_data_text'=>'يرجى إعلامنا إذا كانت المعلومات الشخصية التي نحتفظ بها عنك تحتاج إلى تصحيح أو تحديث',
    'cookies_files'=>'ملفات تعريف الارتباط',
    'cookies_files_text'=>'يستخدم موقعنا ملفات تعريف الارتباط. ملف تعريف الارتباط هو ملف يحتوي على معرف (سلسلة من الحروف والأرقام) يتم إرساله بواسطة خادم الإنترنت إلى متصفح الإنترنت ويتم تخزينه بواسطة المتصفح، ثم يتم إرسال المعرف مرة أخرى إلى الخادم في كل مرة يطلب فيها المتصفح صفحة من الخادم. قد تكون ملفات تعريف الارتباط إما ملفات تعريف ارتباط “دائمة” أو ملفات تعريف ارتباط خاصة بـ “جلسة”: يخزن ملف تعريف الارتباط الدائم بواسطة متصفح الإنترنت ويظل صالحًا حتى تاريخ انتهاء الصلاحية المحدد له، ما لم يتم حذفه من قبل المستخدم قبل تاريخ انتهاء الصلاحية؛ من ناحية أخرى، تنتهي صلاحية ملف تعريف ارتباط الجلسة بنهاية جلسة المستخدم، أي بإغلاق متصفح الإنترنت. لا تحتوي ملفات تعريف الارتباط عادةً على أي معلومات تعرّف عن المستخدم شخصيًا، ولكن قد يتم ربط المعلومات الشخصية التي نخزنها عنك بالمعلومات المخزنة في ملفات تعريف الارتباط التي يتم الحصول عليها منها. { استخدم العبارات المنطبقة نستخدم فقط ملفات تعريف الارتباط للجلسة / فقط ملفات تعريف الارتباط الدائمة / ملفات تعريف الارتباط للجلسة وملفات تعريف الارتباط الدائمة على موقعنا الإلكتروني.
 فيما يلي أسماء ملفات تعريف الارتباط التي نستخدمها على موقعنا الإلكتروني والأغراض التي تستخدم من أجلها :
نستخدم تحليلات جوجل و Adwords على موقعنا للتعرف على جهاز الكمبيوتر عندما يقوم المستخدم }أضف جميع استخدامات ملفات تعريف الارتباط المنطبقة على موقعك زيارة الموقع الإلكتروني / تتبع المستخدمين أثناء تصفحهم للموقع / تمكين استخدام عربة التسوق على الموقع / تحسين قابلية استخدام الموقع / تحليل استخدام الموقع / إدارة الموقع / منع الاحتيال وتحسين أمن الموقع / تخصيص الموقع لكل مستخدم / الإعلانات المستهدفة التي قد تكون ذات أهمية خاصة لمستخدمين محددين / وصف الغرض )}؛
تسمح لك معظم المتصفحات برفض قبول ملفات تعريف الارتباط — على سبيل المثال:
في متصفح إنترنت إكسبلورر Internet Explorer (الإصدار 10)، يمكنك حظر ملفات تعريف الارتباط باستخدام إعدادات تجاوز التعامل مع ملفات تعريف الارتباط المتاحة بالنقر فوق ” أدوات”، و “خيارات إنترنت”، و “الخصوصية”، ثم “خيارات متقدمة”.
في متصفح فايرفوكس Firefox (الإصدار 24)، يمكنك حظر جميع ملفات تعريف الارتباط عن طريق النقر على “أدوات”، و “خيارات”، و “خصوصية”، وتحديد “استخدام الإعدادات المخصصة للتاريخ” من القائمة المنسدلة، وإلغاء تحديد “قبول ملفات تعريف الارتباط من المواقع” .
في كروم Chrome (الإصدار 29)، يمكنك حظر جميع ملفات تعريف الارتباط عن طريق الوصول إلى قائمة “تخصيص والتحكم”، والنقر على “الإعدادات”، و “إظهار الإعدادات المتقدمة”، و “إعدادات المحتوى”، ثم تحديد “حظر المواقع من إعداد أي بيانات” تحت عنوان” ملفات تعريف الارتباط “.
سيكون لحظر جميع ملفات تعريف الارتباط تأثير سلبي على سهولة استخدام العديد من المواقع. إذا قمت بحظر ملفات تعريف الارتباط، فلن تتمكن من استخدام جميع الميزات الموجودة على موقعنا.يمكنك حذف ملفات تعريف الارتباط المخزنة بالفعل على جهاز الكمبيوتر الخاص بك – على سبيل المثال:
في إنترنت إكسبلورر Internet Explorer (الإصدار 10)، يجب عليك حذف ملفات تعريف الارتباط يدويًا (يمكنك العثور على تعليمات للقيام بذلك عبر الرابط التالي http://support.microsoft.com/kb/278835 ) ؛
في فايرفوكس Firefox (الإصدار 24)، يمكنك حذف ملفات تعريف الارتباط بالنقر فوق “أدوات” و “خيارات” و “خصوصية”، ثم تحديد “استخدام إعدادات مخصصة للتاريخ”، والنقر فوق “إظهار ملفات تعريف الارتباط”، ثم النقر فوق “إزالة” جميع ملفات تعريف الارتباط “؛
في كروم Chrome (الإصدار 29)، يمكنك حذف جميع ملفات تعريف الارتباط عن طريق الوصول إلى قائمة “تخصيص والتحكم”، والنقر على “الإعدادات”، و “إظهار الإعدادات المتقدمة”، و “مسح بيانات التصفح”، ثم تحديد “حذف ملفات تعريف الارتباط و بيانات الموقع والمكونات الإضافية الأخرى “قبل النقر فوق” مسح بيانات التصفح “.
سيكون لحذف ملفات تعريف الارتباط تأثير سلبي على سهولة استخدام مواقع الويب الخاصة بالرجل .
',

];
